Revit 2024 API
Entity.SchemaGUID Property
 The GUID of the Schema describing this Entity.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public Guid SchemaGUID { get; }
Visual Basic
Public ReadOnly Property SchemaGUID As Guid
	Get
Visual C++
public:
property Guid SchemaGUID {
	Guid get ();
}
See Also
Entity Class
Autodesk.Revit.DB.ExtensibleStorage Namespace